#include <stdio.h>
// 맞음! but 복잡하기때문에 주의해야함
void main()
{
    int i, j;
    int temp;
    int a[5] = {14, 22, 53, 45, 1};

    for (i = 0; i < 4; i++)
    {
        for (j = 0; j < 4 - i; j++)
        {
            if (a[j] > a[j + 1])
            {
                temp = a[j];
                a[j] = a[j + 1];
                a[j + 1] = temp;
                // 위의 3줄은 a[j] <-> a[j+1] 둘의 값을 교환할 때 사용하는 공식같은 코드!
            }
        }
    }
    for (i = 0; i < 3; i++)
    {
        printf("%d", a[i]); // 띄어쓰기 없으니까 붙여서 5자리 출력
    }
}

/*
1. i=0인 경우 => j<4까지, 즉 j=3까지
j=0; a[0] > a[1] => 14 > 22 => false
j=1; a[1] > a[2] => 22 > 53 => false
j=2; a[2] > a[3] => 53 > 45 => true => a[2] = 45, a[3] = 53
j=3; a[3] > a[4] => 53 > 1 => true => a[3] = 1, a[4] = 53
따라서 a = {14, 22, 45, 1, 53}

2. i=1인 경우 => j<3까지, 즉 j=2까지
j=0; a[0] > a[1] => 14 > 22 => false
j=1; a[1] > a[2] => 22 > 45 => false
j=2; a[2] > a[3] => 45 > 1 => true => a[2] = 1, a[3] = 45
따라서 a = {14, 22, 1, 45, 53}

3. i=2인 경우 => j<2까지, 즉 j=1까지
j=0; a[0] > a[1] => 14 > 22 => false
j=1; a[1] > a[2] => 22 > 1 => true => a[1] = 1, a[2] = 22
따라서 a = {14, 1, 22, 45, 53}

4. i=3인 경우 => j<1까지, 즉 j=0까지
j=0; a[0] > a[1] => 14 > 1 => true => a[0] = 1, a[1] = 14
따라서 a = {1, 14, 22, 45, 53}

>>> 11422
*/
